//Task 1
/*
console.log("Hasmik Davtyan")
alert("my first homework")
*/

//Task2
/*
var name = prompt("text your name");
var age = prompt("text your age");
var city = prompt("text your sity")
alert("Hi, my name is  " + name + ", i am  " + age + ", i am from " + city)
*/

// Task 3
/*
var a = prompt("text any number") // պահանջում չկա ներառյալ, 8, և 20, թե ոչ, այդ պատճառով չեմ ներառում
if (a> 8 && a<20){
    console.log(true)
} else {
    console.log(false)
}
*/

// Task 4 
/*
console.log(undefined || 0 || null || true && "0" && " " && 5 || 9)
// կոնսոլում կարտածի 5, քանի որ նած "և" ու "կամ" օպերատորներից առաջնությւոնը տրվում է և-ին, այսինքն
// սկզբում կստուգվի (true && "0" && " " && 5) արտահայտության ճշմարտացիությունը, իսկ ինչու հենց 5 արժեքը կարտածվի կոնսոլում, քանի որ և օպերատորը ստուգում է բոլոր 
// պարամետրերի ճշմարըացիությունը ու փնտրում սխալ կա, թե ոչ, չգտնելով սխալ պարամետր, նա արտածում է վերջինը
*/

// Task 5
/*console.log("" + 1 + 0)// 10, քանի որ անգամ դատարկ չակերտը ստրինգ է համարվում, իսկ ստրինգին թիվ գումարելիս ծրագիրն այն վերածում է ստռինգի ու կատարում կոնկատացիա
console.log(true + false)// այս բուլյան արժեքները վերածում է թվերի 1 և 0 ու գումարում իրար
console.log("2" * "3") // 6 բազմապատկման դեպքում կատարում է բազմապատկման գործողություն 
console.log("$" + 4 + 5)// $45 ստրինգը թվին գումարել հնարավոր չէ, կատարվում է  կոնկատացիա 
console.log("4px" - 2)// NaN , ստրինգի հետ մաթեմատիկական գործողություն հնարավոր չէ անել
console.log(null + 1)// NaN null-ը կոնվերտացիա է արվում 0-ի մաթեմատիկական գործողություն կատարելիս
console.log(undefined + 1)//NaN  undifined-ը կոնվերտացիա չի լինում թվի, 
console.log("apple" > "pineapple")// false, ստրինգների դեպքում համեմատության նշանը տառերի այբենական դասավրությանն է նայում
console.log("2" > "12")//true, սա ստրինգ է ու այս դեպքում ստուգում է կրկին հերթականությունը, ոստ որի 2-ը ավելի մեծ է, քան 12-ի առաջին նիշը, այսինքն 1-ը

*/



